dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_bf.h
/** \brief Length for Ifx_CIF_BBB_ACCEN0_Bits.EN29 */
#define IFX_CIF_BBB_ACCEN0_EN29_LEN (1u)

/** \brief Mask for Ifx_CIF_BBB_ACCEN0_Bits.EN29 */
#define IFX_CIF_BBB_ACCEN0_EN29_MSK (0x1u)

/** \brief Offset for Ifx_CIF_BBB_ACCEN0_Bits.EN29 */
#define IFX_CIF_BBB_ACCEN0_EN29_OFF (29u)

/** \brief Length for Ifx_CIF_BBB_ACCEN0_Bits.EN30 */
#define IFX_CIF_BBB_ACCEN0_EN30_LEN (1u)

/** \brief Mask for Ifx_CIF_BBB_ACCEN0_Bits.EN30 */
#define IFX_CIF_BBB_ACCEN0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_CIF_BBB_ACCEN0_Bits.EN30 */
#define IFX_CIF_BBB_ACCEN0_EN30_OFF (30u)

/** \brief Length for Ifx_CIF_BBB_ACCEN0_Bits.EN31 */
#define IFX_CIF_BBB_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_CIF_BBB_ACCEN0_Bits.EN31 */
#define IFX_CIF_BBB_ACCEN0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_CIF_BBB_ACCEN0_Bits.EN31 */
#define IFX_CIF_BBB_ACCEN0_EN31_OFF (31u)

/** \brief Length for Ifx_CIF_BBB_KRST0_Bits.RST */
#define IFX_CIF_BBB_KRST0_RST_LEN (1u)

/** \brief Mask for Ifx_CIF_BBB_KRST0_Bits.RST */
#define IFX_CIF_BBB_KRST0_RST_MSK (0x1u)

/** \brief Offset for Ifx_CIF_BBB_KRST0_Bits.RST */
#define IFX_CIF_BBB_KRST0_RST_OFF (0u)

/** \brief Length for Ifx_CIF_BBB_KRST0_Bits.RSTSTAT */
#define IFX_CIF_BBB_KRST0_RSTSTAT_LEN (1u)

/** \brief Mask for Ifx_CIF_BBB_KRST0_Bits.RSTSTAT */
#define IFX_CIF_BBB_KRST0_RSTSTAT_MSK (0x1u)

/** \brief Offset for Ifx_CIF_BBB_KRST0_Bits.RSTSTAT */
#define IFX_CIF_BBB_KRST0_RSTSTAT_OFF (1u)

/** \brief Length for Ifx_CIF_BBB_KRST1_Bits.RST */
#define IFX_CIF_BBB_KRST1_RST_LEN (1u)

/** \brief Mask for Ifx_CIF_BBB_KRST1_Bits.RST */
#define IFX_CIF_BBB_KRST1_RST_MSK (0x1u)

/** \brief Offset for Ifx_CIF_BBB_KRST1_Bits.RST */
#define IFX_CIF_BBB_KRST1_RST_OFF (0u)

/** \brief Length for Ifx_CIF_BBB_KRSTCLR_Bits.CLR */
#define IFX_CIF_BBB_KRSTCLR_CLR_LEN (1u)

/** \brief Mask for Ifx_CIF_BBB_KRSTCLR_Bits.CLR */
#define IFX_CIF_BBB_KRSTCLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_BBB_KRSTCLR_Bits.CLR */
#define IFX_CIF_BBB_KRSTCLR_CLR_OFF (0u)

/** \brief Length for Ifx_CIF_CCL_Bits.CIF_CCLDISS */
#define IFX_CIF_CCL_CIF_CCLDISS_LEN (1u)

/** \brief Mask for Ifx_CIF_CCL_Bits.CIF_CCLDISS */
#define IFX_CIF_CCL_CIF_CCLDISS_MSK (0x1u)

/** \brief Offset for Ifx_CIF_CCL_Bits.CIF_CCLDISS */
#define IFX_CIF_CCL_CIF_CCLDISS_OFF (1u)

/** \brief Length for Ifx_CIF_CCL_Bits.CIF_CCLFDIS */
#define IFX_CIF_CCL_CIF_CCLFDIS_LEN (1u)

/** \brief Mask for Ifx_CIF_CCL_Bits.CIF_CCLFDIS */
#define IFX_CIF_CCL_CIF_CCLFDIS_MSK (0x1u)

/** \brief Offset for Ifx_CIF_CCL_Bits.CIF_CCLFDIS */
#define IFX_CIF_CCL_CIF_CCLFDIS_OFF (2u)

/** \brief Length for Ifx_CIF_ID_Bits.MODREV */
#define IFX_CIF_ID_MODREV_LEN (8u)

/** \brief Mask for Ifx_CIF_ID_Bits.MODREV */
#define IFX_CIF_ID_MODREV_MSK (0xffu)

/** \brief Offset for Ifx_CIF_ID_Bits.MODREV */
#define IFX_CIF_ID_MODREV_OFF (0u)

/** \brief Length for Ifx_CIF_ID_Bits.MODTYPE */
#define IFX_CIF_ID_MODTYPE_LEN (8u)

/** \brief Mask for Ifx_CIF_ID_Bits.MODTYPE */
#define IFX_CIF_ID_MODTYPE_MSK (0xffu)

/** \brief Offset for Ifx_CIF_ID_Bits.MODTYPE */
#define IFX_CIF_ID_MODTYPE_OFF (8u)

/** \brief Length for Ifx_CIF_ID_Bits.MODNUM */
#define IFX_CIF_ID_MODNUM_LEN (16u)

/** \brief Mask for Ifx_CIF_ID_Bits.MODNUM */
#define IFX_CIF_ID_MODNUM_MSK (0xffffu)

/** \brief Offset for Ifx_CIF_ID_Bits.MODNUM */
#define IFX_CIF_ID_MODNUM_OFF (16u)

/** \brief Length for Ifx_CIF_ICCL_Bits.CIF_ISP_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_ISP_CLK_ENABLE_LEN (1u)

/** \brief Mask for Ifx_CIF_ICCL_Bits.CIF_ISP_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_ISP_CLK_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ICCL_Bits.CIF_ISP_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_ISP_CLK_ENABLE_OFF (0u)

/** \brief Length for Ifx_CIF_ICCL_Bits.CIF_JPEG_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_JPEG_CLK_ENABLE_LEN (1u)

/** \brief Mask for Ifx_CIF_ICCL_Bits.CIF_JPEG_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_JPEG_CLK_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ICCL_Bits.CIF_JPEG_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_JPEG_CLK_ENABLE_OFF (5u)

/** \brief Length for Ifx_CIF_ICCL_Bits.CIF_MI_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_MI_CLK_ENABLE_LEN (1u)

/** \brief Mask for Ifx_CIF_ICCL_Bits.CIF_MI_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_MI_CLK_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ICCL_Bits.CIF_MI_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_MI_CLK_ENABLE_OFF (6u)

/** \brief Length for Ifx_CIF_ICCL_Bits.CIF_WATCHDOG_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_WATCHDOG_CLK_ENABLE_LEN (1u)

/** \brief Mask for Ifx_CIF_ICCL_Bits.CIF_WATCHDOG_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_WATCHDOG_CLK_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ICCL_Bits.CIF_WATCHDOG_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_WATCHDOG_CLK_ENABLE_OFF (16u)

/** \brief Length for Ifx_CIF_ICCL_Bits.CIF_LIN_DSCALER_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_LIN_DSCALER_CLK_ENABLE_LEN (1u)

/** \brief Mask for Ifx_CIF_ICCL_Bits.CIF_LIN_DSCALER_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_LIN_DSCALER_CLK_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ICCL_Bits.CIF_LIN_DSCALER_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_LIN_DSCALER_CLK_ENABLE_OFF (17u)

/** \brief Length for Ifx_CIF_ICCL_Bits.CIF_EXTRA_PATHS_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_EXTRA_PATHS_CLK_ENABLE_LEN (1u)

/** \brief Mask for Ifx_CIF_ICCL_Bits.CIF_EXTRA_PATHS_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_EXTRA_PATHS_CLK_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ICCL_Bits.CIF_EXTRA_PATHS_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_EXTRA_PATHS_CLK_ENABLE_OFF (18u)

/** \brief Length for Ifx_CIF_ICCL_Bits.CIF_DEBUG_PATH_CLK_EN */
#define IFX_CIF_ICCL_CIF_DEBUG_PATH_CLK_EN_LEN (1u)

/** \brief Mask for Ifx_CIF_ICCL_Bits.CIF_DEBUG_PATH_CLK_EN */
#define IFX_CIF_ICCL_CIF_DEBUG_PATH_CLK_EN_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ICCL_Bits.CIF_DEBUG_PATH_CLK_EN */
#define IFX_CIF_ICCL_CIF_DEBUG_PATH_CLK_EN_OFF (19u)

/** \brief Length for Ifx_CIF_IRCL_Bits.CIF_ISP_SOFT_RST */
#define IFX_CIF_IRCL_CIF_ISP_SOFT_RST_LEN (1u)

/** \brief Mask for Ifx_CIF_IRCL_Bits.CIF_ISP_SOFT_RST */
#define IFX_CIF_IRCL_CIF_ISP_SOFT_RST_MSK (0x1u)

/** \brief Offset for Ifx_CIF_IRCL_Bits.CIF_ISP_SOFT_RST */
#define IFX_CIF_IRCL_CIF_ISP_SOFT_RST_OFF (0u)

/** \brief Length for Ifx_CIF_IRCL_Bits.CIF_YCS_SOFT_RST */
#define IFX_CIF_IRCL_CIF_YCS_SOFT_RST_LEN (1u)

/** \brief Mask for Ifx_CIF_IRCL_Bits.CIF_YCS_SOFT_RST */
#define IFX_CIF_IRCL_CIF_YCS_SOFT_RST_MSK (0x1u)

/** \brief Offset for Ifx_CIF_IRCL_Bits.CIF_YCS_SOFT_RST */
#define IFX_CIF_IRCL_CIF_YCS_SOFT_RST_OFF (2u)

/** \brief Length for Ifx_CIF_IRCL_Bits.CIF_JPEG_SOFT_RST */
#define IFX_CIF_IRCL_CIF_JPEG_SOFT_RST_LEN (1u)

/** \brief Mask for Ifx_CIF_IRCL_Bits.CIF_JPEG_SOFT_RST */
#define IFX_CIF_IRCL_CIF_JPEG_SOFT_RST_MSK (0x1u)

/** \brief Offset for Ifx_CIF_IRCL_Bits.CIF_JPEG_SOFT_RST */
#define IFX_CIF_IRCL_CIF_JPEG_SOFT_RST_OFF (5u)

/** \brief Length for Ifx_CIF_IRCL_Bits.CIF_MI_SOFT_RST */
#define IFX_CIF_IRCL_CIF_MI_SOFT_RST_LEN (1u)

/** \brief Mask for Ifx_CIF_IRCL_Bits.CIF_MI_SOFT_RST */
#define IFX_CIF_IRCL_CIF_MI_SOFT_RST_MSK (0x1u)

