dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_bf.h
/** \brief Offset for Ifx_CIF_IRCL_Bits.CIF_MI_SOFT_RST */
#define IFX_CIF_IRCL_CIF_MI_SOFT_RST_OFF (6u)

/** \brief Length for Ifx_CIF_IRCL_Bits.CIF_GLOBAL_RST */
#define IFX_CIF_IRCL_CIF_GLOBAL_RST_LEN (1u)

/** \brief Mask for Ifx_CIF_IRCL_Bits.CIF_GLOBAL_RST */
#define IFX_CIF_IRCL_CIF_GLOBAL_RST_MSK (0x1u)

/** \brief Offset for Ifx_CIF_IRCL_Bits.CIF_GLOBAL_RST */
#define IFX_CIF_IRCL_CIF_GLOBAL_RST_OFF (7u)

/** \brief Length for Ifx_CIF_IRCL_Bits.CIF_WATCHDOG_RST */
#define IFX_CIF_IRCL_CIF_WATCHDOG_RST_LEN (1u)

/** \brief Mask for Ifx_CIF_IRCL_Bits.CIF_WATCHDOG_RST */
#define IFX_CIF_IRCL_CIF_WATCHDOG_RST_MSK (0x1u)

/** \brief Offset for Ifx_CIF_IRCL_Bits.CIF_WATCHDOG_RST */
#define IFX_CIF_IRCL_CIF_WATCHDOG_RST_OFF (16u)

/** \brief Length for Ifx_CIF_IRCL_Bits.CIF_LIN_DSCALER_RST */
#define IFX_CIF_IRCL_CIF_LIN_DSCALER_RST_LEN (1u)

/** \brief Mask for Ifx_CIF_IRCL_Bits.CIF_LIN_DSCALER_RST */
#define IFX_CIF_IRCL_CIF_LIN_DSCALER_RST_MSK (0x1u)

/** \brief Offset for Ifx_CIF_IRCL_Bits.CIF_LIN_DSCALER_RST */
#define IFX_CIF_IRCL_CIF_LIN_DSCALER_RST_OFF (17u)

/** \brief Length for Ifx_CIF_IRCL_Bits.CIF_EXTRA_PATHS_RST */
#define IFX_CIF_IRCL_CIF_EXTRA_PATHS_RST_LEN (1u)

/** \brief Mask for Ifx_CIF_IRCL_Bits.CIF_EXTRA_PATHS_RST */
#define IFX_CIF_IRCL_CIF_EXTRA_PATHS_RST_MSK (0x1u)

/** \brief Offset for Ifx_CIF_IRCL_Bits.CIF_EXTRA_PATHS_RST */
#define IFX_CIF_IRCL_CIF_EXTRA_PATHS_RST_OFF (18u)

/** \brief Length for Ifx_CIF_IRCL_Bits.CIF_DEBUG_PATH_RST */
#define IFX_CIF_IRCL_CIF_DEBUG_PATH_RST_LEN (1u)

/** \brief Mask for Ifx_CIF_IRCL_Bits.CIF_DEBUG_PATH_RST */
#define IFX_CIF_IRCL_CIF_DEBUG_PATH_RST_MSK (0x1u)

/** \brief Offset for Ifx_CIF_IRCL_Bits.CIF_DEBUG_PATH_RST */
#define IFX_CIF_IRCL_CIF_DEBUG_PATH_RST_OFF (19u)

/** \brief Length for Ifx_CIF_DPCL_Bits.CIF_MP_MUX */
#define IFX_CIF_DPCL_CIF_MP_MUX_LEN (2u)

/** \brief Mask for Ifx_CIF_DPCL_Bits.CIF_MP_MUX */
#define IFX_CIF_DPCL_CIF_MP_MUX_MSK (0x3u)

/** \brief Offset for Ifx_CIF_DPCL_Bits.CIF_MP_MUX */
#define IFX_CIF_DPCL_CIF_MP_MUX_OFF (0u)

/** \brief Length for Ifx_CIF_DPCL_Bits.CIF_CHAN_MODE */
#define IFX_CIF_DPCL_CIF_CHAN_MODE_LEN (2u)

/** \brief Mask for Ifx_CIF_DPCL_Bits.CIF_CHAN_MODE */
#define IFX_CIF_DPCL_CIF_CHAN_MODE_MSK (0x3u)

/** \brief Offset for Ifx_CIF_DPCL_Bits.CIF_CHAN_MODE */
#define IFX_CIF_DPCL_CIF_CHAN_MODE_OFF (2u)

/** \brief Length for Ifx_CIF_DPCL_Bits.IF_SELECT */
#define IFX_CIF_DPCL_IF_SELECT_LEN (2u)

/** \brief Mask for Ifx_CIF_DPCL_Bits.IF_SELECT */
#define IFX_CIF_DPCL_IF_SELECT_MSK (0x3u)

/** \brief Offset for Ifx_CIF_DPCL_Bits.IF_SELECT */
#define IFX_CIF_DPCL_IF_SELECT_OFF (8u)

/** \brief Length for Ifx_CIF_ISP_CTRL_Bits.ISP_ENABLE */
#define IFX_CIF_ISP_CTRL_ISP_ENABLE_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_CTRL_Bits.ISP_ENABLE */
#define IFX_CIF_ISP_CTRL_ISP_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_CTRL_Bits.ISP_ENABLE */
#define IFX_CIF_ISP_CTRL_ISP_ENABLE_OFF (0u)

/** \brief Length for Ifx_CIF_ISP_CTRL_Bits.ISP_MODE */
#define IFX_CIF_ISP_CTRL_ISP_MODE_LEN (3u)

/** \brief Mask for Ifx_CIF_ISP_CTRL_Bits.ISP_MODE */
#define IFX_CIF_ISP_CTRL_ISP_MODE_MSK (0x7u)

/** \brief Offset for Ifx_CIF_ISP_CTRL_Bits.ISP_MODE */
#define IFX_CIF_ISP_CTRL_ISP_MODE_OFF (1u)

/** \brief Length for Ifx_CIF_ISP_CTRL_Bits.ISP_INFORM_ENABLE */
#define IFX_CIF_ISP_CTRL_ISP_INFORM_ENABLE_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_CTRL_Bits.ISP_INFORM_ENABLE */
#define IFX_CIF_ISP_CTRL_ISP_INFORM_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_CTRL_Bits.ISP_INFORM_ENABLE */
#define IFX_CIF_ISP_CTRL_ISP_INFORM_ENABLE_OFF (4u)

/** \brief Length for Ifx_CIF_ISP_CTRL_Bits.ISP_CFG_UPD */
#define IFX_CIF_ISP_CTRL_ISP_CFG_UPD_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_CTRL_Bits.ISP_CFG_UPD */
#define IFX_CIF_ISP_CTRL_ISP_CFG_UPD_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_CTRL_Bits.ISP_CFG_UPD */
#define IFX_CIF_ISP_CTRL_ISP_CFG_UPD_OFF (9u)

/** \brief Length for Ifx_CIF_ISP_CTRL_Bits.ISP_GEN_CFG_UPD */
#define IFX_CIF_ISP_CTRL_ISP_GEN_CFG_UPD_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_CTRL_Bits.ISP_GEN_CFG_UPD */
#define IFX_CIF_ISP_CTRL_ISP_GEN_CFG_UPD_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_CTRL_Bits.ISP_GEN_CFG_UPD */
#define IFX_CIF_ISP_CTRL_ISP_GEN_CFG_UPD_OFF (10u)

/** \brief Length for Ifx_CIF_ISP_CTRL_Bits.ISP_CSM_Y_RANGE */
#define IFX_CIF_ISP_CTRL_ISP_CSM_Y_RANGE_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_CTRL_Bits.ISP_CSM_Y_RANGE */
#define IFX_CIF_ISP_CTRL_ISP_CSM_Y_RANGE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_CTRL_Bits.ISP_CSM_Y_RANGE */
#define IFX_CIF_ISP_CTRL_ISP_CSM_Y_RANGE_OFF (13u)

/** \brief Length for Ifx_CIF_ISP_CTRL_Bits.ISP_CSM_C_RANGE */
#define IFX_CIF_ISP_CTRL_ISP_CSM_C_RANGE_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_CTRL_Bits.ISP_CSM_C_RANGE */
#define IFX_CIF_ISP_CTRL_ISP_CSM_C_RANGE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_CTRL_Bits.ISP_CSM_C_RANGE */
#define IFX_CIF_ISP_CTRL_ISP_CSM_C_RANGE_OFF (14u)

/** \brief Length for Ifx_CIF_ISP_ACQ_PROP_Bits.SAMPLE_EDGE */
#define IFX_CIF_ISP_ACQ_PROP_SAMPLE_EDGE_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.SAMPLE_EDGE */
#define IFX_CIF_ISP_ACQ_PROP_SAMPLE_EDGE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.SAMPLE_EDGE */
#define IFX_CIF_ISP_ACQ_PROP_SAMPLE_EDGE_OFF (0u)

/** \brief Length for Ifx_CIF_ISP_ACQ_PROP_Bits.HSYNC_POL */
#define IFX_CIF_ISP_ACQ_PROP_HSYNC_POL_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.HSYNC_POL */
#define IFX_CIF_ISP_ACQ_PROP_HSYNC_POL_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.HSYNC_POL */
#define IFX_CIF_ISP_ACQ_PROP_HSYNC_POL_OFF (1u)

/** \brief Length for Ifx_CIF_ISP_ACQ_PROP_Bits.VSYNC_POL */
#define IFX_CIF_ISP_ACQ_PROP_VSYNC_POL_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.VSYNC_POL */
#define IFX_CIF_ISP_ACQ_PROP_VSYNC_POL_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.VSYNC_POL */
#define IFX_CIF_ISP_ACQ_PROP_VSYNC_POL_OFF (2u)

/** \brief Length for Ifx_CIF_ISP_ACQ_PROP_Bits.CCIR_SEQ */
#define IFX_CIF_ISP_ACQ_PROP_CCIR_SEQ_LEN (2u)

/** \brief Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.CCIR_SEQ */
#define IFX_CIF_ISP_ACQ_PROP_CCIR_SEQ_MSK (0x3u)

/** \brief Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.CCIR_SEQ */
#define IFX_CIF_ISP_ACQ_PROP_CCIR_SEQ_OFF (7u)

/** \brief Length for Ifx_CIF_ISP_ACQ_PROP_Bits.FIELD_SELECTION */
#define IFX_CIF_ISP_ACQ_PROP_FIELD_SELECTION_LEN (2u)

/** \brief Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.FIELD_SELECTION */
#define IFX_CIF_ISP_ACQ_PROP_FIELD_SELECTION_MSK (0x3u)

/** \brief Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.FIELD_SELECTION */
#define IFX_CIF_ISP_ACQ_PROP_FIELD_SELECTION_OFF (9u)

/** \brief Length for Ifx_CIF_ISP_ACQ_PROP_Bits.FIELD_INVERT */
#define IFX_CIF_ISP_ACQ_PROP_FIELD_INVERT_LEN (1u)

/** \brief Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.FIELD_INVERT */
#define IFX_CIF_ISP_ACQ_PROP_FIELD_INVERT_MSK (0x1u)

