dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_bf.h
/** \brief Length for Ifx_CIF_MI_MP_CR_BASE_AD_SHD_Bits.MP_CR_BASE_AD */
#define IFX_CIF_MI_MP_CR_BASE_AD_SHD_MP_CR_BASE_AD_LEN (30u)

/** \brief Mask for Ifx_CIF_MI_MP_CR_BASE_AD_SHD_Bits.MP_CR_BASE_AD */
#define IFX_CIF_MI_MP_CR_BASE_AD_SHD_MP_CR_BASE_AD_MSK (0x3fffffffu)

/** \brief Offset for Ifx_CIF_MI_MP_CR_BASE_AD_SHD_Bits.MP_CR_BASE_AD */
#define IFX_CIF_MI_MP_CR_BASE_AD_SHD_MP_CR_BASE_AD_OFF (2u)

/** \brief Length for Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_SIZE_SHD_FIXED_TO_00_LEN (2u)

/** \brief Mask for Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_SIZE_SHD_FIXED_TO_00_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_SIZE_SHD_FIXED_TO_00_OFF (0u)

/** \brief Length for Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits.MP_CR_SIZE */
#define IFX_CIF_MI_MP_CR_SIZE_SHD_MP_CR_SIZE_LEN (22u)

/** \brief Mask for Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits.MP_CR_SIZE */
#define IFX_CIF_MI_MP_CR_SIZE_SHD_MP_CR_SIZE_MSK (0x3fffffu)

/** \brief Offset for Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits.MP_CR_SIZE */
#define IFX_CIF_MI_MP_CR_SIZE_SHD_MP_CR_SIZE_OFF (2u)

/** \brief Length for Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_SHD_FIXED_TO_00_LEN (2u)

/** \brief Mask for Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_SHD_FIXED_TO_00_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_SHD_FIXED_TO_00_OFF (0u)

/** \brief Length for Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD_Bits.MP_CR_OFFS_CNT */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_SHD_MP_CR_OFFS_CNT_LEN (22u)

/** \brief Mask for Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD_Bits.MP_CR_OFFS_CNT */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_SHD_MP_CR_OFFS_CNT_MSK (0x3fffffu)

/** \brief Offset for Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD_Bits.MP_CR_OFFS_CNT */
#define IFX_CIF_MI_MP_CR_OFFS_CNT_SHD_MP_CR_OFFS_CNT_OFF (2u)

/** \brief Length for Ifx_CIF_MI_IMSC_Bits.MP_FRAME_END */
#define IFX_CIF_MI_IMSC_MP_FRAME_END_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_IMSC_Bits.MP_FRAME_END */
#define IFX_CIF_MI_IMSC_MP_FRAME_END_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_IMSC_Bits.MP_FRAME_END */
#define IFX_CIF_MI_IMSC_MP_FRAME_END_OFF (0u)

/** \brief Length for Ifx_CIF_MI_IMSC_Bits.MBLK_LINE */
#define IFX_CIF_MI_IMSC_MBLK_LINE_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_IMSC_Bits.MBLK_LINE */
#define IFX_CIF_MI_IMSC_MBLK_LINE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_IMSC_Bits.MBLK_LINE */
#define IFX_CIF_MI_IMSC_MBLK_LINE_OFF (2u)

/** \brief Length for Ifx_CIF_MI_IMSC_Bits.FILL_MP_Y */
#define IFX_CIF_MI_IMSC_FILL_MP_Y_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_IMSC_Bits.FILL_MP_Y */
#define IFX_CIF_MI_IMSC_FILL_MP_Y_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_IMSC_Bits.FILL_MP_Y */
#define IFX_CIF_MI_IMSC_FILL_MP_Y_OFF (3u)

/** \brief Length for Ifx_CIF_MI_IMSC_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_IMSC_WRAP_MP_Y_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_IMSC_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_IMSC_WRAP_MP_Y_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_IMSC_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_IMSC_WRAP_MP_Y_OFF (4u)

/** \brief Length for Ifx_CIF_MI_IMSC_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_IMSC_WRAP_MP_CB_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_IMSC_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_IMSC_WRAP_MP_CB_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_IMSC_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_IMSC_WRAP_MP_CB_OFF (5u)

/** \brief Length for Ifx_CIF_MI_IMSC_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_IMSC_WRAP_MP_CR_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_IMSC_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_IMSC_WRAP_MP_CR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_IMSC_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_IMSC_WRAP_MP_CR_OFF (6u)

/** \brief Length for Ifx_CIF_MI_IMSC_Bits.BUS_ERROR */
#define IFX_CIF_MI_IMSC_BUS_ERROR_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_IMSC_Bits.BUS_ERROR */
#define IFX_CIF_MI_IMSC_BUS_ERROR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_IMSC_Bits.BUS_ERROR */
#define IFX_CIF_MI_IMSC_BUS_ERROR_OFF (10u)

/** \brief Length for Ifx_CIF_MI_RIS_Bits.MP_FRAME_END */
#define IFX_CIF_MI_RIS_MP_FRAME_END_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_RIS_Bits.MP_FRAME_END */
#define IFX_CIF_MI_RIS_MP_FRAME_END_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_RIS_Bits.MP_FRAME_END */
#define IFX_CIF_MI_RIS_MP_FRAME_END_OFF (0u)

/** \brief Length for Ifx_CIF_MI_RIS_Bits.MBLK_LINE */
#define IFX_CIF_MI_RIS_MBLK_LINE_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_RIS_Bits.MBLK_LINE */
#define IFX_CIF_MI_RIS_MBLK_LINE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_RIS_Bits.MBLK_LINE */
#define IFX_CIF_MI_RIS_MBLK_LINE_OFF (2u)

/** \brief Length for Ifx_CIF_MI_RIS_Bits.FILL_MP_Y */
#define IFX_CIF_MI_RIS_FILL_MP_Y_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_RIS_Bits.FILL_MP_Y */
#define IFX_CIF_MI_RIS_FILL_MP_Y_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_RIS_Bits.FILL_MP_Y */
#define IFX_CIF_MI_RIS_FILL_MP_Y_OFF (3u)

/** \brief Length for Ifx_CIF_MI_RIS_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_RIS_WRAP_MP_Y_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_RIS_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_RIS_WRAP_MP_Y_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_RIS_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_RIS_WRAP_MP_Y_OFF (4u)

/** \brief Length for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_RIS_WRAP_MP_CB_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_RIS_WRAP_MP_CB_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_RIS_WRAP_MP_CB_OFF (5u)

/** \brief Length for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_RIS_WRAP_MP_CR_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_RIS_WRAP_MP_CR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_RIS_WRAP_MP_CR_OFF (6u)

/** \brief Length for Ifx_CIF_MI_RIS_Bits.BUS_ERROR */
#define IFX_CIF_MI_RIS_BUS_ERROR_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_RIS_Bits.BUS_ERROR */
#define IFX_CIF_MI_RIS_BUS_ERROR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_RIS_Bits.BUS_ERROR */
#define IFX_CIF_MI_RIS_BUS_ERROR_OFF (10u)

/** \brief Length for Ifx_CIF_MI_MIS_Bits.MP_FRAME_END */
#define IFX_CIF_MI_MIS_MP_FRAME_END_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_MIS_Bits.MP_FRAME_END */
#define IFX_CIF_MI_MIS_MP_FRAME_END_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_MIS_Bits.MP_FRAME_END */
#define IFX_CIF_MI_MIS_MP_FRAME_END_OFF (0u)

/** \brief Length for Ifx_CIF_MI_MIS_Bits.MBLK_LINE */
#define IFX_CIF_MI_MIS_MBLK_LINE_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_MIS_Bits.MBLK_LINE */
#define IFX_CIF_MI_MIS_MBLK_LINE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_MIS_Bits.MBLK_LINE */
#define IFX_CIF_MI_MIS_MBLK_LINE_OFF (2u)

/** \brief Length for Ifx_CIF_MI_MIS_Bits.FILL_MP_Y */
#define IFX_CIF_MI_MIS_FILL_MP_Y_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_MIS_Bits.FILL_MP_Y */
#define IFX_CIF_MI_MIS_FILL_MP_Y_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_MIS_Bits.FILL_MP_Y */
#define IFX_CIF_MI_MIS_FILL_MP_Y_OFF (3u)

/** \brief Length for Ifx_CIF_MI_MIS_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_MIS_WRAP_MP_Y_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_MIS_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_MIS_WRAP_MP_Y_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_MIS_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_MIS_WRAP_MP_Y_OFF (4u)

/** \brief Length for Ifx_CIF_MI_MIS_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_MIS_WRAP_MP_CB_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_MIS_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_MIS_WRAP_MP_CB_MSK (0x1u)

