dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_bf.h
/** \brief Offset for Ifx_CIF_MI_MIS_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_MIS_WRAP_MP_CB_OFF (5u)

/** \brief Length for Ifx_CIF_MI_MIS_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_MIS_WRAP_MP_CR_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_MIS_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_MIS_WRAP_MP_CR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_MIS_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_MIS_WRAP_MP_CR_OFF (6u)

/** \brief Length for Ifx_CIF_MI_MIS_Bits.BUS_ERROR */
#define IFX_CIF_MI_MIS_BUS_ERROR_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_MIS_Bits.BUS_ERROR */
#define IFX_CIF_MI_MIS_BUS_ERROR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_MIS_Bits.BUS_ERROR */
#define IFX_CIF_MI_MIS_BUS_ERROR_OFF (10u)

/** \brief Length for Ifx_CIF_MI_ICR_Bits.MP_FRAME_END */
#define IFX_CIF_MI_ICR_MP_FRAME_END_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_ICR_Bits.MP_FRAME_END */
#define IFX_CIF_MI_ICR_MP_FRAME_END_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_ICR_Bits.MP_FRAME_END */
#define IFX_CIF_MI_ICR_MP_FRAME_END_OFF (0u)

/** \brief Length for Ifx_CIF_MI_ICR_Bits.MBLK_LINE */
#define IFX_CIF_MI_ICR_MBLK_LINE_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_ICR_Bits.MBLK_LINE */
#define IFX_CIF_MI_ICR_MBLK_LINE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_ICR_Bits.MBLK_LINE */
#define IFX_CIF_MI_ICR_MBLK_LINE_OFF (2u)

/** \brief Length for Ifx_CIF_MI_ICR_Bits.FILL_MPY */
#define IFX_CIF_MI_ICR_FILL_MPY_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_ICR_Bits.FILL_MPY */
#define IFX_CIF_MI_ICR_FILL_MPY_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_ICR_Bits.FILL_MPY */
#define IFX_CIF_MI_ICR_FILL_MPY_OFF (3u)

/** \brief Length for Ifx_CIF_MI_ICR_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_ICR_WRAP_MP_Y_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_ICR_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_ICR_WRAP_MP_Y_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_ICR_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_ICR_WRAP_MP_Y_OFF (4u)

/** \brief Length for Ifx_CIF_MI_ICR_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_ICR_WRAP_MP_CB_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_ICR_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_ICR_WRAP_MP_CB_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_ICR_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_ICR_WRAP_MP_CB_OFF (5u)

/** \brief Length for Ifx_CIF_MI_ICR_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_ICR_WRAP_MP_CR_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_ICR_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_ICR_WRAP_MP_CR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_ICR_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_ICR_WRAP_MP_CR_OFF (6u)

/** \brief Length for Ifx_CIF_MI_ICR_Bits.BUS_ERROR */
#define IFX_CIF_MI_ICR_BUS_ERROR_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_ICR_Bits.BUS_ERROR */
#define IFX_CIF_MI_ICR_BUS_ERROR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_ICR_Bits.BUS_ERROR */
#define IFX_CIF_MI_ICR_BUS_ERROR_OFF (10u)

/** \brief Length for Ifx_CIF_MI_ISR_Bits.MP_FRAME_END */
#define IFX_CIF_MI_ISR_MP_FRAME_END_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_ISR_Bits.MP_FRAME_END */
#define IFX_CIF_MI_ISR_MP_FRAME_END_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_ISR_Bits.MP_FRAME_END */
#define IFX_CIF_MI_ISR_MP_FRAME_END_OFF (0u)

/** \brief Length for Ifx_CIF_MI_ISR_Bits.MBLK_LINE */
#define IFX_CIF_MI_ISR_MBLK_LINE_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_ISR_Bits.MBLK_LINE */
#define IFX_CIF_MI_ISR_MBLK_LINE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_ISR_Bits.MBLK_LINE */
#define IFX_CIF_MI_ISR_MBLK_LINE_OFF (2u)

/** \brief Length for Ifx_CIF_MI_ISR_Bits.FILL_MP_Y */
#define IFX_CIF_MI_ISR_FILL_MP_Y_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_ISR_Bits.FILL_MP_Y */
#define IFX_CIF_MI_ISR_FILL_MP_Y_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_ISR_Bits.FILL_MP_Y */
#define IFX_CIF_MI_ISR_FILL_MP_Y_OFF (3u)

/** \brief Length for Ifx_CIF_MI_ISR_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_ISR_WRAP_MP_Y_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_ISR_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_ISR_WRAP_MP_Y_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_ISR_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_ISR_WRAP_MP_Y_OFF (4u)

/** \brief Length for Ifx_CIF_MI_ISR_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_ISR_WRAP_MP_CB_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_ISR_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_ISR_WRAP_MP_CB_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_ISR_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_ISR_WRAP_MP_CB_OFF (5u)

/** \brief Length for Ifx_CIF_MI_ISR_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_ISR_WRAP_MP_CR_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_ISR_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_ISR_WRAP_MP_CR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_ISR_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_ISR_WRAP_MP_CR_OFF (6u)

/** \brief Length for Ifx_CIF_MI_ISR_Bits.Bus_ERROR */
#define IFX_CIF_MI_ISR_BUS_ERROR_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_ISR_Bits.Bus_ERROR */
#define IFX_CIF_MI_ISR_BUS_ERROR_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_ISR_Bits.Bus_ERROR */
#define IFX_CIF_MI_ISR_BUS_ERROR_OFF (10u)

/** \brief Length for Ifx_CIF_MI_STATUS_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_Y_FIFO_FULL_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_STATUS_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_Y_FIFO_FULL_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_STATUS_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_Y_FIFO_FULL_OFF (0u)

/** \brief Length for Ifx_CIF_MI_STATUS_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CB_FIFO_FULL_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_STATUS_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CB_FIFO_FULL_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_STATUS_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CB_FIFO_FULL_OFF (1u)

/** \brief Length for Ifx_CIF_MI_STATUS_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CR_FIFO_FULL_LEN (1u)

/** \brief Mask for Ifx_CIF_MI_STATUS_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CR_FIFO_FULL_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MI_STATUS_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CR_FIFO_FULL_OFF (2u)

/** \brief Length for Ifx_CIF_MI_STATUS_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_BUS_WRITE_ERROR_LEN (1u)

