dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_bf.h
/** \brief Offset for Ifx_CIF_JPE_STATUS_ICR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_ICR_ENCODE_DONE_OFF (4u)

/** \brief Length for Ifx_CIF_JPE_STATUS_ICR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_ICR_GEN_HEADER_DONE_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_STATUS_ICR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_ICR_GEN_HEADER_DONE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_STATUS_ICR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_ICR_GEN_HEADER_DONE_OFF (5u)

/** \brief Length for Ifx_CIF_JPE_STATUS_ISR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_ISR_ENCODE_DONE_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_STATUS_ISR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_ISR_ENCODE_DONE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_STATUS_ISR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_ISR_ENCODE_DONE_OFF (4u)

/** \brief Length for Ifx_CIF_JPE_STATUS_ISR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_ISR_GEN_HEADER_DONE_LEN (1u)

/** \brief Mask for Ifx_CIF_JPE_STATUS_ISR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_ISR_GEN_HEADER_DONE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_JPE_STATUS_ISR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_ISR_GEN_HEADER_DONE_OFF (5u)

/** \brief Length for Ifx_CIF_ISPIS_CTRL_Bits.IS_EN */
#define IFX_CIF_ISPIS_CTRL_IS_EN_LEN (1u)

/** \brief Mask for Ifx_CIF_ISPIS_CTRL_Bits.IS_EN */
#define IFX_CIF_ISPIS_CTRL_IS_EN_MSK (0x1u)

/** \brief Offset for Ifx_CIF_ISPIS_CTRL_Bits.IS_EN */
#define IFX_CIF_ISPIS_CTRL_IS_EN_OFF (0u)

/** \brief Length for Ifx_CIF_ISPIS_RECENTER_Bits.RECENTER */
#define IFX_CIF_ISPIS_RECENTER_RECENTER_LEN (3u)

/** \brief Mask for Ifx_CIF_ISPIS_RECENTER_Bits.RECENTER */
#define IFX_CIF_ISPIS_RECENTER_RECENTER_MSK (0x7u)

/** \brief Offset for Ifx_CIF_ISPIS_RECENTER_Bits.RECENTER */
#define IFX_CIF_ISPIS_RECENTER_RECENTER_OFF (0u)

/** \brief Length for Ifx_CIF_ISPIS_H_OFFS_Bits.IS_H_OFFS */
#define IFX_CIF_ISPIS_H_OFFS_IS_H_OFFS_LEN (12u)

/** \brief Mask for Ifx_CIF_ISPIS_H_OFFS_Bits.IS_H_OFFS */
#define IFX_CIF_ISPIS_H_OFFS_IS_H_OFFS_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_ISPIS_H_OFFS_Bits.IS_H_OFFS */
#define IFX_CIF_ISPIS_H_OFFS_IS_H_OFFS_OFF (0u)

/** \brief Length for Ifx_CIF_ISPIS_V_OFFS_Bits.IS_V_OFFS */
#define IFX_CIF_ISPIS_V_OFFS_IS_V_OFFS_LEN (12u)

/** \brief Mask for Ifx_CIF_ISPIS_V_OFFS_Bits.IS_V_OFFS */
#define IFX_CIF_ISPIS_V_OFFS_IS_V_OFFS_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_ISPIS_V_OFFS_Bits.IS_V_OFFS */
#define IFX_CIF_ISPIS_V_OFFS_IS_V_OFFS_OFF (0u)

/** \brief Length for Ifx_CIF_ISPIS_H_SIZE_Bits.IS_H_SIZE */
#define IFX_CIF_ISPIS_H_SIZE_IS_H_SIZE_LEN (12u)

/** \brief Mask for Ifx_CIF_ISPIS_H_SIZE_Bits.IS_H_SIZE */
#define IFX_CIF_ISPIS_H_SIZE_IS_H_SIZE_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_ISPIS_H_SIZE_Bits.IS_H_SIZE */
#define IFX_CIF_ISPIS_H_SIZE_IS_H_SIZE_OFF (0u)

/** \brief Length for Ifx_CIF_ISPIS_V_SIZE_Bits.IS_V_SIZE */
#define IFX_CIF_ISPIS_V_SIZE_IS_V_SIZE_LEN (12u)

/** \brief Mask for Ifx_CIF_ISPIS_V_SIZE_Bits.IS_V_SIZE */
#define IFX_CIF_ISPIS_V_SIZE_IS_V_SIZE_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_ISPIS_V_SIZE_Bits.IS_V_SIZE */
#define IFX_CIF_ISPIS_V_SIZE_IS_V_SIZE_OFF (0u)

/** \brief Length for Ifx_CIF_ISPIS_MAX_DX_Bits.IS_MAX_DX */
#define IFX_CIF_ISPIS_MAX_DX_IS_MAX_DX_LEN (12u)

/** \brief Mask for Ifx_CIF_ISPIS_MAX_DX_Bits.IS_MAX_DX */
#define IFX_CIF_ISPIS_MAX_DX_IS_MAX_DX_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_ISPIS_MAX_DX_Bits.IS_MAX_DX */
#define IFX_CIF_ISPIS_MAX_DX_IS_MAX_DX_OFF (0u)

/** \brief Length for Ifx_CIF_ISPIS_MAX_DY_Bits.IS_MAX_DY */
#define IFX_CIF_ISPIS_MAX_DY_IS_MAX_DY_LEN (12u)

/** \brief Mask for Ifx_CIF_ISPIS_MAX_DY_Bits.IS_MAX_DY */
#define IFX_CIF_ISPIS_MAX_DY_IS_MAX_DY_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_ISPIS_MAX_DY_Bits.IS_MAX_DY */
#define IFX_CIF_ISPIS_MAX_DY_IS_MAX_DY_OFF (0u)

/** \brief Length for Ifx_CIF_ISPIS_DISPLACE_Bits.DX */
#define IFX_CIF_ISPIS_DISPLACE_DX_LEN (12u)

/** \brief Mask for Ifx_CIF_ISPIS_DISPLACE_Bits.DX */
#define IFX_CIF_ISPIS_DISPLACE_DX_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_ISPIS_DISPLACE_Bits.DX */
#define IFX_CIF_ISPIS_DISPLACE_DX_OFF (0u)

/** \brief Length for Ifx_CIF_ISPIS_DISPLACE_Bits.DY */
#define IFX_CIF_ISPIS_DISPLACE_DY_LEN (12u)

/** \brief Mask for Ifx_CIF_ISPIS_DISPLACE_Bits.DY */
#define IFX_CIF_ISPIS_DISPLACE_DY_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_ISPIS_DISPLACE_Bits.DY */
#define IFX_CIF_ISPIS_DISPLACE_DY_OFF (16u)

/** \brief Length for Ifx_CIF_ISPIS_H_OFFS_SHD_Bits.IS_H_OFFS_SHD */
#define IFX_CIF_ISPIS_H_OFFS_SHD_IS_H_OFFS_SHD_LEN (13u)

/** \brief Mask for Ifx_CIF_ISPIS_H_OFFS_SHD_Bits.IS_H_OFFS_SHD */
#define IFX_CIF_ISPIS_H_OFFS_SHD_IS_H_OFFS_SHD_MSK (0x1fffu)

/** \brief Offset for Ifx_CIF_ISPIS_H_OFFS_SHD_Bits.IS_H_OFFS_SHD */
#define IFX_CIF_ISPIS_H_OFFS_SHD_IS_H_OFFS_SHD_OFF (0u)

/** \brief Length for Ifx_CIF_ISPIS_V_OFFS_SHD_Bits.IS_V_OFFS_SHD */
#define IFX_CIF_ISPIS_V_OFFS_SHD_IS_V_OFFS_SHD_LEN (12u)

/** \brief Mask for Ifx_CIF_ISPIS_V_OFFS_SHD_Bits.IS_V_OFFS_SHD */
#define IFX_CIF_ISPIS_V_OFFS_SHD_IS_V_OFFS_SHD_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_ISPIS_V_OFFS_SHD_Bits.IS_V_OFFS_SHD */
#define IFX_CIF_ISPIS_V_OFFS_SHD_IS_V_OFFS_SHD_OFF (0u)

/** \brief Length for Ifx_CIF_ISPIS_H_SIZE_SHD_Bits.ISP_H_SIZE_SHD */
#define IFX_CIF_ISPIS_H_SIZE_SHD_ISP_H_SIZE_SHD_LEN (13u)

/** \brief Mask for Ifx_CIF_ISPIS_H_SIZE_SHD_Bits.ISP_H_SIZE_SHD */
#define IFX_CIF_ISPIS_H_SIZE_SHD_ISP_H_SIZE_SHD_MSK (0x1fffu)

/** \brief Offset for Ifx_CIF_ISPIS_H_SIZE_SHD_Bits.ISP_H_SIZE_SHD */
#define IFX_CIF_ISPIS_H_SIZE_SHD_ISP_H_SIZE_SHD_OFF (0u)

/** \brief Length for Ifx_CIF_ISPIS_V_SIZE_SHD_Bits.ISP_V_SIZE_SHD */
#define IFX_CIF_ISPIS_V_SIZE_SHD_ISP_V_SIZE_SHD_LEN (12u)

/** \brief Mask for Ifx_CIF_ISPIS_V_SIZE_SHD_Bits.ISP_V_SIZE_SHD */
#define IFX_CIF_ISPIS_V_SIZE_SHD_ISP_V_SIZE_SHD_MSK (0xfffu)

/** \brief Offset for Ifx_CIF_ISPIS_V_SIZE_SHD_Bits.ISP_V_SIZE_SHD */
#define IFX_CIF_ISPIS_V_SIZE_SHD_ISP_V_SIZE_SHD_OFF (0u)

/** \brief Length for Ifx_CIF_WD_CTRL_Bits.WD_EN */
#define IFX_CIF_WD_CTRL_WD_EN_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_CTRL_Bits.WD_EN */
#define IFX_CIF_WD_CTRL_WD_EN_MSK (0x1u)

