dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_bf.h
/** \brief Offset for Ifx_CIF_WD_CTRL_Bits.WD_EN */
#define IFX_CIF_WD_CTRL_WD_EN_OFF (0u)

/** \brief Length for Ifx_CIF_WD_CTRL_Bits.RST_H_CNT */
#define IFX_CIF_WD_CTRL_RST_H_CNT_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_CTRL_Bits.RST_H_CNT */
#define IFX_CIF_WD_CTRL_RST_H_CNT_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_CTRL_Bits.RST_H_CNT */
#define IFX_CIF_WD_CTRL_RST_H_CNT_OFF (1u)

/** \brief Length for Ifx_CIF_WD_CTRL_Bits.RST_V_CNT */
#define IFX_CIF_WD_CTRL_RST_V_CNT_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_CTRL_Bits.RST_V_CNT */
#define IFX_CIF_WD_CTRL_RST_V_CNT_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_CTRL_Bits.RST_V_CNT */
#define IFX_CIF_WD_CTRL_RST_V_CNT_OFF (2u)

/** \brief Length for Ifx_CIF_WD_CTRL_Bits.RST_PD_CNT */
#define IFX_CIF_WD_CTRL_RST_PD_CNT_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_CTRL_Bits.RST_PD_CNT */
#define IFX_CIF_WD_CTRL_RST_PD_CNT_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_CTRL_Bits.RST_PD_CNT */
#define IFX_CIF_WD_CTRL_RST_PD_CNT_OFF (3u)

/** \brief Length for Ifx_CIF_WD_CTRL_Bits.WD_PREDIV */
#define IFX_CIF_WD_CTRL_WD_PREDIV_LEN (16u)

/** \brief Mask for Ifx_CIF_WD_CTRL_Bits.WD_PREDIV */
#define IFX_CIF_WD_CTRL_WD_PREDIV_MSK (0xffffu)

/** \brief Offset for Ifx_CIF_WD_CTRL_Bits.WD_PREDIV */
#define IFX_CIF_WD_CTRL_WD_PREDIV_OFF (16u)

/** \brief Length for Ifx_CIF_WD_V_TIMEOUT_Bits.WD_VSE_TO */
#define IFX_CIF_WD_V_TIMEOUT_WD_VSE_TO_LEN (16u)

/** \brief Mask for Ifx_CIF_WD_V_TIMEOUT_Bits.WD_VSE_TO */
#define IFX_CIF_WD_V_TIMEOUT_WD_VSE_TO_MSK (0xffffu)

/** \brief Offset for Ifx_CIF_WD_V_TIMEOUT_Bits.WD_VSE_TO */
#define IFX_CIF_WD_V_TIMEOUT_WD_VSE_TO_OFF (0u)

/** \brief Length for Ifx_CIF_WD_V_TIMEOUT_Bits.WD_VES_TO */
#define IFX_CIF_WD_V_TIMEOUT_WD_VES_TO_LEN (16u)

/** \brief Mask for Ifx_CIF_WD_V_TIMEOUT_Bits.WD_VES_TO */
#define IFX_CIF_WD_V_TIMEOUT_WD_VES_TO_MSK (0xffffu)

/** \brief Offset for Ifx_CIF_WD_V_TIMEOUT_Bits.WD_VES_TO */
#define IFX_CIF_WD_V_TIMEOUT_WD_VES_TO_OFF (16u)

/** \brief Length for Ifx_CIF_WD_H_TIMEOUT_Bits.WD_HSE_TO */
#define IFX_CIF_WD_H_TIMEOUT_WD_HSE_TO_LEN (16u)

/** \brief Mask for Ifx_CIF_WD_H_TIMEOUT_Bits.WD_HSE_TO */
#define IFX_CIF_WD_H_TIMEOUT_WD_HSE_TO_MSK (0xffffu)

/** \brief Offset for Ifx_CIF_WD_H_TIMEOUT_Bits.WD_HSE_TO */
#define IFX_CIF_WD_H_TIMEOUT_WD_HSE_TO_OFF (0u)

/** \brief Length for Ifx_CIF_WD_H_TIMEOUT_Bits.WD_HES_TO */
#define IFX_CIF_WD_H_TIMEOUT_WD_HES_TO_LEN (16u)

/** \brief Mask for Ifx_CIF_WD_H_TIMEOUT_Bits.WD_HES_TO */
#define IFX_CIF_WD_H_TIMEOUT_WD_HES_TO_MSK (0xffffu)

/** \brief Offset for Ifx_CIF_WD_H_TIMEOUT_Bits.WD_HES_TO */
#define IFX_CIF_WD_H_TIMEOUT_WD_HES_TO_OFF (16u)

/** \brief Length for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_VES_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_VES_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_VES_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_VES_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_VES_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_VES_TO_OFF (0u)

/** \brief Length for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_VSE_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_VSE_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_VSE_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_VSE_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_VSE_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_VSE_TO_OFF (1u)

/** \brief Length for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_HES_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_HES_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_HES_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_HES_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_HES_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_HES_TO_OFF (2u)

/** \brief Length for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_HSE_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_HSE_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_HSE_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_HSE_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_HSE_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_HSE_TO_OFF (3u)

/** \brief Length for Ifx_CIF_WD_RIS_Bits.RIS_WD_VES_TO */
#define IFX_CIF_WD_RIS_RIS_WD_VES_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_RIS_Bits.RIS_WD_VES_TO */
#define IFX_CIF_WD_RIS_RIS_WD_VES_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_RIS_Bits.RIS_WD_VES_TO */
#define IFX_CIF_WD_RIS_RIS_WD_VES_TO_OFF (0u)

/** \brief Length for Ifx_CIF_WD_RIS_Bits.RIS_WD_VSE_TO */
#define IFX_CIF_WD_RIS_RIS_WD_VSE_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_RIS_Bits.RIS_WD_VSE_TO */
#define IFX_CIF_WD_RIS_RIS_WD_VSE_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_RIS_Bits.RIS_WD_VSE_TO */
#define IFX_CIF_WD_RIS_RIS_WD_VSE_TO_OFF (1u)

/** \brief Length for Ifx_CIF_WD_RIS_Bits.RIS_WD_HES_TO */
#define IFX_CIF_WD_RIS_RIS_WD_HES_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_RIS_Bits.RIS_WD_HES_TO */
#define IFX_CIF_WD_RIS_RIS_WD_HES_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_RIS_Bits.RIS_WD_HES_TO */
#define IFX_CIF_WD_RIS_RIS_WD_HES_TO_OFF (2u)

/** \brief Length for Ifx_CIF_WD_RIS_Bits.RIS_WD_HSE_TO */
#define IFX_CIF_WD_RIS_RIS_WD_HSE_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_RIS_Bits.RIS_WD_HSE_TO */
#define IFX_CIF_WD_RIS_RIS_WD_HSE_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_RIS_Bits.RIS_WD_HSE_TO */
#define IFX_CIF_WD_RIS_RIS_WD_HSE_TO_OFF (3u)

/** \brief Length for Ifx_CIF_WD_MIS_Bits.MIS_WD_VES_TO */
#define IFX_CIF_WD_MIS_MIS_WD_VES_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_MIS_Bits.MIS_WD_VES_TO */
#define IFX_CIF_WD_MIS_MIS_WD_VES_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_MIS_Bits.MIS_WD_VES_TO */
#define IFX_CIF_WD_MIS_MIS_WD_VES_TO_OFF (0u)

/** \brief Length for Ifx_CIF_WD_MIS_Bits.MIS_WD_VSE_TO */
#define IFX_CIF_WD_MIS_MIS_WD_VSE_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_MIS_Bits.MIS_WD_VSE_TO */
#define IFX_CIF_WD_MIS_MIS_WD_VSE_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_MIS_Bits.MIS_WD_VSE_TO */
#define IFX_CIF_WD_MIS_MIS_WD_VSE_TO_OFF (1u)

/** \brief Length for Ifx_CIF_WD_MIS_Bits.MIS_WD_HES_TO */
#define IFX_CIF_WD_MIS_MIS_WD_HES_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_MIS_Bits.MIS_WD_HES_TO */
#define IFX_CIF_WD_MIS_MIS_WD_HES_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_MIS_Bits.MIS_WD_HES_TO */
#define IFX_CIF_WD_MIS_MIS_WD_HES_TO_OFF (2u)

/** \brief Length for Ifx_CIF_WD_MIS_Bits.MIS_WD_HSE_TO */
#define IFX_CIF_WD_MIS_MIS_WD_HSE_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_MIS_Bits.MIS_WD_HSE_TO */
#define IFX_CIF_WD_MIS_MIS_WD_HSE_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_MIS_Bits.MIS_WD_HSE_TO */
#define IFX_CIF_WD_MIS_MIS_WD_HSE_TO_OFF (3u)

