dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_bf.h
/** \brief Length for Ifx_CIF_WD_ICR_Bits.ICR_WD_VES_TO */
#define IFX_CIF_WD_ICR_ICR_WD_VES_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_ICR_Bits.ICR_WD_VES_TO */
#define IFX_CIF_WD_ICR_ICR_WD_VES_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_ICR_Bits.ICR_WD_VES_TO */
#define IFX_CIF_WD_ICR_ICR_WD_VES_TO_OFF (0u)

/** \brief Length for Ifx_CIF_WD_ICR_Bits.ICR_WD_VSE_TO */
#define IFX_CIF_WD_ICR_ICR_WD_VSE_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_ICR_Bits.ICR_WD_VSE_TO */
#define IFX_CIF_WD_ICR_ICR_WD_VSE_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_ICR_Bits.ICR_WD_VSE_TO */
#define IFX_CIF_WD_ICR_ICR_WD_VSE_TO_OFF (1u)

/** \brief Length for Ifx_CIF_WD_ICR_Bits.ICR_WD_HES_TO */
#define IFX_CIF_WD_ICR_ICR_WD_HES_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_ICR_Bits.ICR_WD_HES_TO */
#define IFX_CIF_WD_ICR_ICR_WD_HES_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_ICR_Bits.ICR_WD_HES_TO */
#define IFX_CIF_WD_ICR_ICR_WD_HES_TO_OFF (2u)

/** \brief Length for Ifx_CIF_WD_ICR_Bits.ICR_WD_HSE_TO */
#define IFX_CIF_WD_ICR_ICR_WD_HSE_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_ICR_Bits.ICR_WD_HSE_TO */
#define IFX_CIF_WD_ICR_ICR_WD_HSE_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_ICR_Bits.ICR_WD_HSE_TO */
#define IFX_CIF_WD_ICR_ICR_WD_HSE_TO_OFF (3u)

/** \brief Length for Ifx_CIF_WD_ISR_Bits.ISR_WD_VES_TO */
#define IFX_CIF_WD_ISR_ISR_WD_VES_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_ISR_Bits.ISR_WD_VES_TO */
#define IFX_CIF_WD_ISR_ISR_WD_VES_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_ISR_Bits.ISR_WD_VES_TO */
#define IFX_CIF_WD_ISR_ISR_WD_VES_TO_OFF (0u)

/** \brief Length for Ifx_CIF_WD_ISR_Bits.ISR_WD_VSE_TO */
#define IFX_CIF_WD_ISR_ISR_WD_VSE_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_ISR_Bits.ISR_WD_VSE_TO */
#define IFX_CIF_WD_ISR_ISR_WD_VSE_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_ISR_Bits.ISR_WD_VSE_TO */
#define IFX_CIF_WD_ISR_ISR_WD_VSE_TO_OFF (1u)

/** \brief Length for Ifx_CIF_WD_ISR_Bits.ISR_WD_HES_TO */
#define IFX_CIF_WD_ISR_ISR_WD_HES_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_ISR_Bits.ISR_WD_HES_TO */
#define IFX_CIF_WD_ISR_ISR_WD_HES_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_ISR_Bits.ISR_WD_HES_TO */
#define IFX_CIF_WD_ISR_ISR_WD_HES_TO_OFF (2u)

/** \brief Length for Ifx_CIF_WD_ISR_Bits.ISR_WD_HSE_TO */
#define IFX_CIF_WD_ISR_ISR_WD_HSE_TO_LEN (1u)

/** \brief Mask for Ifx_CIF_WD_ISR_Bits.ISR_WD_HSE_TO */
#define IFX_CIF_WD_ISR_ISR_WD_HSE_TO_MSK (0x1u)

/** \brief Offset for Ifx_CIF_WD_ISR_Bits.ISR_WD_HSE_TO */
#define IFX_CIF_WD_ISR_ISR_WD_HSE_TO_OFF (3u)

/** \brief Length for Ifx_CIF_LDS_CTRL_Bits.LDS_V_EN */
#define IFX_CIF_LDS_CTRL_LDS_V_EN_LEN (1u)

/** \brief Mask for Ifx_CIF_LDS_CTRL_Bits.LDS_V_EN */
#define IFX_CIF_LDS_CTRL_LDS_V_EN_MSK (0x1u)

/** \brief Offset for Ifx_CIF_LDS_CTRL_Bits.LDS_V_EN */
#define IFX_CIF_LDS_CTRL_LDS_V_EN_OFF (0u)

/** \brief Length for Ifx_CIF_LDS_CTRL_Bits.LDS_H_EN */
#define IFX_CIF_LDS_CTRL_LDS_H_EN_LEN (1u)

/** \brief Mask for Ifx_CIF_LDS_CTRL_Bits.LDS_H_EN */
#define IFX_CIF_LDS_CTRL_LDS_H_EN_MSK (0x1u)

/** \brief Offset for Ifx_CIF_LDS_CTRL_Bits.LDS_H_EN */
#define IFX_CIF_LDS_CTRL_LDS_H_EN_OFF (1u)

/** \brief Length for Ifx_CIF_LDS_CTRL_Bits.LDS_V_MODE */
#define IFX_CIF_LDS_CTRL_LDS_V_MODE_LEN (2u)

/** \brief Mask for Ifx_CIF_LDS_CTRL_Bits.LDS_V_MODE */
#define IFX_CIF_LDS_CTRL_LDS_V_MODE_MSK (0x3u)

/** \brief Offset for Ifx_CIF_LDS_CTRL_Bits.LDS_V_MODE */
#define IFX_CIF_LDS_CTRL_LDS_V_MODE_OFF (4u)

/** \brief Length for Ifx_CIF_LDS_CTRL_Bits.LDS_H_MODE */
#define IFX_CIF_LDS_CTRL_LDS_H_MODE_LEN (2u)

/** \brief Mask for Ifx_CIF_LDS_CTRL_Bits.LDS_H_MODE */
#define IFX_CIF_LDS_CTRL_LDS_H_MODE_MSK (0x3u)

/** \brief Offset for Ifx_CIF_LDS_CTRL_Bits.LDS_H_MODE */
#define IFX_CIF_LDS_CTRL_LDS_H_MODE_OFF (8u)

/** \brief Length for Ifx_CIF_LDS_FAC_Bits.LDS_V_FAC */
#define IFX_CIF_LDS_FAC_LDS_V_FAC_LEN (8u)

/** \brief Mask for Ifx_CIF_LDS_FAC_Bits.LDS_V_FAC */
#define IFX_CIF_LDS_FAC_LDS_V_FAC_MSK (0xffu)

/** \brief Offset for Ifx_CIF_LDS_FAC_Bits.LDS_V_FAC */
#define IFX_CIF_LDS_FAC_LDS_V_FAC_OFF (0u)

/** \brief Length for Ifx_CIF_LDS_FAC_Bits.LDS_H_FAC */
#define IFX_CIF_LDS_FAC_LDS_H_FAC_LEN (8u)

/** \brief Mask for Ifx_CIF_LDS_FAC_Bits.LDS_H_FAC */
#define IFX_CIF_LDS_FAC_LDS_H_FAC_MSK (0xffu)

/** \brief Offset for Ifx_CIF_LDS_FAC_Bits.LDS_H_FAC */
#define IFX_CIF_LDS_FAC_LDS_H_FAC_OFF (16u)

/** \brief Length for Ifx_CIF_DP_CTRL_Bits.DP_EN */
#define IFX_CIF_DP_CTRL_DP_EN_LEN (1u)

/** \brief Mask for Ifx_CIF_DP_CTRL_Bits.DP_EN */
#define IFX_CIF_DP_CTRL_DP_EN_MSK (0x1u)

/** \brief Offset for Ifx_CIF_DP_CTRL_Bits.DP_EN */
#define IFX_CIF_DP_CTRL_DP_EN_OFF (0u)

/** \brief Length for Ifx_CIF_DP_CTRL_Bits.DP_SEL */
#define IFX_CIF_DP_CTRL_DP_SEL_LEN (3u)

/** \brief Mask for Ifx_CIF_DP_CTRL_Bits.DP_SEL */
#define IFX_CIF_DP_CTRL_DP_SEL_MSK (0x7u)

/** \brief Offset for Ifx_CIF_DP_CTRL_Bits.DP_SEL */
#define IFX_CIF_DP_CTRL_DP_SEL_OFF (1u)

/** \brief Length for Ifx_CIF_DP_CTRL_Bits.RST_FNC */
#define IFX_CIF_DP_CTRL_RST_FNC_LEN (1u)

/** \brief Mask for Ifx_CIF_DP_CTRL_Bits.RST_FNC */
#define IFX_CIF_DP_CTRL_RST_FNC_MSK (0x1u)

/** \brief Offset for Ifx_CIF_DP_CTRL_Bits.RST_FNC */
#define IFX_CIF_DP_CTRL_RST_FNC_OFF (8u)

/** \brief Length for Ifx_CIF_DP_CTRL_Bits.RST_LNC */
#define IFX_CIF_DP_CTRL_RST_LNC_LEN (1u)

/** \brief Mask for Ifx_CIF_DP_CTRL_Bits.RST_LNC */
#define IFX_CIF_DP_CTRL_RST_LNC_MSK (0x1u)

/** \brief Offset for Ifx_CIF_DP_CTRL_Bits.RST_LNC */
#define IFX_CIF_DP_CTRL_RST_LNC_OFF (9u)

/** \brief Length for Ifx_CIF_DP_CTRL_Bits.RST_TSC */
#define IFX_CIF_DP_CTRL_RST_TSC_LEN (1u)

/** \brief Mask for Ifx_CIF_DP_CTRL_Bits.RST_TSC */
#define IFX_CIF_DP_CTRL_RST_TSC_MSK (0x1u)

/** \brief Offset for Ifx_CIF_DP_CTRL_Bits.RST_TSC */
#define IFX_CIF_DP_CTRL_RST_TSC_OFF (10u)

/** \brief Length for Ifx_CIF_DP_CTRL_Bits.RST_PD */
#define IFX_CIF_DP_CTRL_RST_PD_LEN (1u)

/** \brief Mask for Ifx_CIF_DP_CTRL_Bits.RST_PD */
#define IFX_CIF_DP_CTRL_RST_PD_MSK (0x1u)

/** \brief Offset for Ifx_CIF_DP_CTRL_Bits.RST_PD */
#define IFX_CIF_DP_CTRL_RST_PD_OFF (11u)

