dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxCif_bf.h
/** \brief Length for Ifx_CIF_MIEP_ISR_Bits.FRAME_END_EP_4 */
#define IFX_CIF_MIEP_ISR_FRAME_END_EP_4_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_ISR_Bits.FRAME_END_EP_4 */
#define IFX_CIF_MIEP_ISR_FRAME_END_EP_4_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_ISR_Bits.FRAME_END_EP_4 */
#define IFX_CIF_MIEP_ISR_FRAME_END_EP_4_OFF (12u)

/** \brief Length for Ifx_CIF_MIEP_ISR_Bits.FILL_EP_4 */
#define IFX_CIF_MIEP_ISR_FILL_EP_4_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_ISR_Bits.FILL_EP_4 */
#define IFX_CIF_MIEP_ISR_FILL_EP_4_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_ISR_Bits.FILL_EP_4 */
#define IFX_CIF_MIEP_ISR_FILL_EP_4_OFF (13u)

/** \brief Length for Ifx_CIF_MIEP_ISR_Bits.WRAP_EP_4 */
#define IFX_CIF_MIEP_ISR_WRAP_EP_4_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_ISR_Bits.WRAP_EP_4 */
#define IFX_CIF_MIEP_ISR_WRAP_EP_4_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_ISR_Bits.WRAP_EP_4 */
#define IFX_CIF_MIEP_ISR_WRAP_EP_4_OFF (14u)

/** \brief Length for Ifx_CIF_MIEP_ISR_Bits.MBLK_LINE_EP_4 */
#define IFX_CIF_MIEP_ISR_MBLK_LINE_EP_4_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_ISR_Bits.MBLK_LINE_EP_4 */
#define IFX_CIF_MIEP_ISR_MBLK_LINE_EP_4_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_ISR_Bits.MBLK_LINE_EP_4 */
#define IFX_CIF_MIEP_ISR_MBLK_LINE_EP_4_OFF (15u)

/** \brief Length for Ifx_CIF_MIEP_ISR_Bits.FRAME_END_EP_5 */
#define IFX_CIF_MIEP_ISR_FRAME_END_EP_5_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_ISR_Bits.FRAME_END_EP_5 */
#define IFX_CIF_MIEP_ISR_FRAME_END_EP_5_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_ISR_Bits.FRAME_END_EP_5 */
#define IFX_CIF_MIEP_ISR_FRAME_END_EP_5_OFF (16u)

/** \brief Length for Ifx_CIF_MIEP_ISR_Bits.FILL_EP_5 */
#define IFX_CIF_MIEP_ISR_FILL_EP_5_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_ISR_Bits.FILL_EP_5 */
#define IFX_CIF_MIEP_ISR_FILL_EP_5_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_ISR_Bits.FILL_EP_5 */
#define IFX_CIF_MIEP_ISR_FILL_EP_5_OFF (17u)

/** \brief Length for Ifx_CIF_MIEP_ISR_Bits.WRAP_EP_5 */
#define IFX_CIF_MIEP_ISR_WRAP_EP_5_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_ISR_Bits.WRAP_EP_5 */
#define IFX_CIF_MIEP_ISR_WRAP_EP_5_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_ISR_Bits.WRAP_EP_5 */
#define IFX_CIF_MIEP_ISR_WRAP_EP_5_OFF (18u)

/** \brief Length for Ifx_CIF_MIEP_ISR_Bits.MBLK_LINE_EP_5 */
#define IFX_CIF_MIEP_ISR_MBLK_LINE_EP_5_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_ISR_Bits.MBLK_LINE_EP_5 */
#define IFX_CIF_MIEP_ISR_MBLK_LINE_EP_5_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_ISR_Bits.MBLK_LINE_EP_5 */
#define IFX_CIF_MIEP_ISR_MBLK_LINE_EP_5_OFF (19u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_CTRL_Bits.EP_ENABLE */
#define IFX_CIF_MIEP_CH_1S_CTRL_EP_ENABLE_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_CTRL_Bits.EP_ENABLE */
#define IFX_CIF_MIEP_CH_1S_CTRL_EP_ENABLE_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_CTRL_Bits.EP_ENABLE */
#define IFX_CIF_MIEP_CH_1S_CTRL_EP_ENABLE_OFF (0u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MIEP_CH_1S_CTRL_BYTE_SWAP_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MIEP_CH_1S_CTRL_BYTE_SWAP_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MIEP_CH_1S_CTRL_BYTE_SWAP_OFF (7u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MIEP_CH_1S_CTRL_INIT_BASE_EN_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MIEP_CH_1S_CTRL_INIT_BASE_EN_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MIEP_CH_1S_CTRL_INIT_BASE_EN_OFF (20u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MIEP_CH_1S_CTRL_INIT_OFFSET_EN_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MIEP_CH_1S_CTRL_INIT_OFFSET_EN_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MIEP_CH_1S_CTRL_INIT_OFFSET_EN_OFF (21u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_CTRL_Bits.EP_WRITE_FORMAT */
#define IFX_CIF_MIEP_CH_1S_CTRL_EP_WRITE_FORMAT_LEN (2u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_CTRL_Bits.EP_WRITE_FORMAT */
#define IFX_CIF_MIEP_CH_1S_CTRL_EP_WRITE_FORMAT_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_CTRL_Bits.EP_WRITE_FORMAT */
#define IFX_CIF_MIEP_CH_1S_CTRL_EP_WRITE_FORMAT_OFF (22u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_INIT_Bits.MI_EP_SKIP */
#define IFX_CIF_MIEP_CH_1S_INIT_MI_EP_SKIP_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_INIT_Bits.MI_EP_SKIP */
#define IFX_CIF_MIEP_CH_1S_INIT_MI_EP_SKIP_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_INIT_Bits.MI_EP_SKIP */
#define IFX_CIF_MIEP_CH_1S_INIT_MI_EP_SKIP_OFF (2u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_INIT_Bits.MI_EP_CFG_UPD */
#define IFX_CIF_MIEP_CH_1S_INIT_MI_EP_CFG_UPD_LEN (1u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_INIT_Bits.MI_EP_CFG_UPD */
#define IFX_CIF_MIEP_CH_1S_INIT_MI_EP_CFG_UPD_MSK (0x1u)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_INIT_Bits.MI_EP_CFG_UPD */
#define IFX_CIF_MIEP_CH_1S_INIT_MI_EP_CFG_UPD_OFF (4u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_BASE_AD_INIT_FIXED_TO_00_LEN (2u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_BASE_AD_INIT_FIXED_TO_00_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_BASE_AD_INIT_FIXED_TO_00_OFF (0u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT_Bits.EP_BASE_AD_INIT */
#define IFX_CIF_MIEP_CH_1S_BASE_AD_INIT_EP_BASE_AD_INIT_LEN (30u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT_Bits.EP_BASE_AD_INIT */
#define IFX_CIF_MIEP_CH_1S_BASE_AD_INIT_EP_BASE_AD_INIT_MSK (0x3fffffffu)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_BASE_AD_INIT_Bits.EP_BASE_AD_INIT */
#define IFX_CIF_MIEP_CH_1S_BASE_AD_INIT_EP_BASE_AD_INIT_OFF (2u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_SIZE_INIT_FIXED_TO_00_LEN (2u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_SIZE_INIT_FIXED_TO_00_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_SIZE_INIT_FIXED_TO_00_OFF (0u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_SIZE_INIT_Bits.EP_SIZE_INIT */
#define IFX_CIF_MIEP_CH_1S_SIZE_INIT_EP_SIZE_INIT_LEN (22u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_SIZE_INIT_Bits.EP_SIZE_INIT */
#define IFX_CIF_MIEP_CH_1S_SIZE_INIT_EP_SIZE_INIT_MSK (0x3fffffu)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_SIZE_INIT_Bits.EP_SIZE_INIT */
#define IFX_CIF_MIEP_CH_1S_SIZE_INIT_EP_SIZE_INIT_OFF (2u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_OFFS_CNT_INIT_FIXED_TO_00_LEN (2u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_OFFS_CNT_INIT_FIXED_TO_00_MSK (0x3u)

/** \brief Offset for Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_1S_OFFS_CNT_INIT_FIXED_TO_00_OFF (0u)

/** \brief Length for Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT_Bits.EP_OFFS_CNT_INIT */
#define IFX_CIF_MIEP_CH_1S_OFFS_CNT_INIT_EP_OFFS_CNT_INIT_LEN (22u)

/** \brief Mask for Ifx_CIF_MIEP_CH_1S_OFFS_CNT_INIT_Bits.EP_OFFS_CNT_INIT */
#define IFX_CIF_MIEP_CH_1S_OFFS_CNT_INIT_EP_OFFS_CNT_INIT_MSK (0x3fffffu)

